fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитыДоговораАО();	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить("ГруппаРеквизитыАО",Тип("ГруппаФормы"), ЭтотОбъект);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Реквизиты договора Абонентского обслуживания";
	
	НовыйЭлемент = Элементы.Добавить ("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_СуммаАП", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАП";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент = Элементы.Добавить ("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"),Группа);
    НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
    НовыйЭлемент.Вид  = ВидПоляФормы.ПолеВвода;
 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитыДоговораАО();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьРеквизитыДоговораАО()

	Если Объект.ВидДоговора = ПредопределенноеЗначение ("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаРеквизитыАО.Видимость = Истина;
	Иначе
		Элементы.ГруппаРеквизитыАО.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
